УНФ_ТЕСТ/src/Documents/МаркировкаТоваровИСМП/МаркировкаТоваровИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаркировкаТоваровИСМП</name>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукцииИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДекларации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПервичногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИмпорта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеМаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроизводственногоЗаказа</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроизводственнойЛинии</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТаможенногоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентГосИС</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ВидыОперацийИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятоеРешение</name>
    <type>
      <types>EnumRef.ПринятыеРешенияИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерДекларации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияНанесения</name>
    <type>
      <types>EnumRef.ВидыОперацийИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетПроизводственнойЛинии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводства</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокументаСертификации</name>
      <comment>Вид документа обязательной сертификации</comment>
      <type>
        <types>EnumRef.ВидыДокументовОбязательнойСертификацииИСМП</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокументаСертификации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокументаСертификации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидМаркировки</name>
      <type>
        <types>EnumRef.ВидыМаркировкиСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроизводства</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДекларации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомерДекларации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПроисхожденияВЕТИС</name>
      <type>
        <types>DefinedType.ИдентификаторПроисхожденияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>DefinedType.GTIN</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаГосИСНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>DefinedType.СтавкаНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаГосИСНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПроисхожденияВЕТИС</name>
      <type>
        <types>DefinedType.ИдентификаторПроисхожденияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеОтчетаПроизводственнойЛинии</name>
    <attributes>
      <name>ЗначениеШтрихкода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеШтрихкодаУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УНФ_ТЕСТ/src/Enums/ВидыПродукцииИС/ВидыПродукцииИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПродукцииИС</name>
  <enumValues>
    <name>Алкогольная</name>
  </enumValues>
  <enumValues>
    <name>Табак</name>
  </enumValues>
  <enumValues>
    <name>Обувь</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>Фотоаппараты</name>
  </enumValues>
  <enumValues>
    <name>Духи</name>
  </enumValues>
  <enumValues>
    <name>Велосипеды</name>
  </enumValues>
  <enumValues>
    <name>КреслаКоляски</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабак</name>
  </enumValues>
  <enumValues>
    <name>УпакованнаяВода</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Enums/ВидыОперацийИСМП/ВидыОперацийИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийИСМП</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АгрегацияИзменение</name>
  </enumValues>
  <enumValues>
    <name>АгрегацияСоздание</name>
  </enumValues>
  <enumValues>
    <name>АгрегацияУдаление</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотМаркировкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотПолучениеПродукцииОтФизическихЛиц</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотПроизводствоВнеЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотПроизводствоРФ</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотПроизводствоРФПоДоговору</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотТрансграничнаяТорговля</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотПроизводствоРФПоДоговоруНаСторонеЗаказчика</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаБезвозмезднаяПередача</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаВозвратФизическомуЛицу</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаВПроцессеРеализацииПоДоговоруРассрочки</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаИспользованиеДляСобственныхНуждПредприятия</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаКонфискацияТовара</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаКредитныйДоговор</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаЛиквидацияПредприятия</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаРеализацияКонфискованныхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаРеализацияПоДоговоруРассрочки</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаРозничнаяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаУничтожениеТовара</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаУтратаПовреждениеТовара</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаЭкспортВСтраныЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаЭкспортЗаПределыСтранЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаПродажаПоОбразцамДистанционнаяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаБрак</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаИстечениеСрокаГодности</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаЛабораторныеОбразцы</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаОтзывСРынка</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаРекламации</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаДругиеПричины</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаТестированиеПродукта</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаЭмиссиюКодовМаркировки</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаЭмиссиюКодовМаркировкиЗапросGTINНаОстатки</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаЭмиссиюКодовМаркировкиРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеПодзаказаНаЭмиссиюКодовМаркировкиСУЗ</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОбИспользованииРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОбИспользованииКодовМаркировки</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОВерификацииНанесенныхКМ</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПередачеКМНаПринтер</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПередачеКМНаПроизводственнуюЛинию</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПечатиКМ</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПотереРаспечатанныхКМ</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеКодовМаркировкиИзСУЗ</name>
  </enumValues>
  <enumValues>
    <name>ПовторноеПолучениеКодовМаркировкиИзСУЗ</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеРезультатаОбработкиДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеРезультатаОбработкиЗаказаНаЭмиссиюКодовМаркировки</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеСтатусаПулаКодовМаркировкиИзСУЗ</name>
  </enumValues>
  <enumValues>
    <name>СписаниеВведенныхВОборотКодовМаркировки</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЭмитированныхКодовМаркировки</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПродажа</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаБезвозмезднаяПередача</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПриобретениеГосПредприятием</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаДляСобственныхНуждПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаКомиссия</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаАгент</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаАннулировать</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаАннулирование</name>
  </enumValues>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПродажа</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаБезвозмезднаяПередача</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКомиссия</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаАгент</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПриобретениеГосПредприятием</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаДляСобственныхНуждПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаОтклонить</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаОтклонен</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаТрансграничнаяТорговля</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаВходящихДокументов</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборотПриРозничнойРеализации</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборотПриДистанционномСпособеПродажи</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Documents/МаркировкаТоваровИСМП/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ДополнительныеСвойства.Свойство("НеЗаполнятьТабличнуюЧасть") Тогда
		Товары.Очистить();
		ШтрихкодыУпаковок.Очистить();
	КонецЕсли;
	
	ИнтеграцияИСМППереопределяемый.ОбработкаЗаполненияДокумента(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	ЗаполнитьОбъектПоСтатистике();
	
	ЗаполнитьТабличнуюЧастьТоварыСрокомГодностиВЕТИС();
	
	ИнтеграцияИСМППереопределяемый.ЗаполнитьКодыТНВЭДПоНоменклатуреВТабличнойЧасти(Товары);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	// Обувная продукция
	НепроверяемыеРеквизиты.Добавить("ПринятоеРешение");
	НепроверяемыеРеквизиты.Добавить("КодТаможенногоОргана");
	НепроверяемыеРеквизиты.Добавить("СтранаПроисхождения");
	НепроверяемыеРеквизиты.Добавить("ДатаДекларации");
	НепроверяемыеРеквизиты.Добавить("РегистрационныйНомерДекларации");
	НепроверяемыеРеквизиты.Добавить("Контрагент");
	НепроверяемыеРеквизиты.Добавить("ДатаПроизводства");
	НепроверяемыеРеквизиты.Добавить("ДатаИмпорта");
	НепроверяемыеРеквизиты.Добавить("ДатаПервичногоДокумента");
	НепроверяемыеРеквизиты.Добавить("НомерПервичногоДокумента");
	НепроверяемыеРеквизиты.Добавить("Товары.GTIN");
	
	// Молочная продукция
	НепроверяемыеРеквизиты.Добавить("Товары.ИдентификаторПроисхожденияВЕТИС");
	НепроверяемыеРеквизиты.Добавить("Товары.СрокГодности");
	
	ОбязательныеРеквизиты = Новый Массив;
	
	Если ОтчетПроизводственнойЛинии Тогда
		
		НепроверяемыеРеквизиты.Добавить("Товары");
		
	Иначе
		
		НепроверяемыеРеквизиты.Добавить("ДанныеОтчетаПроизводственнойЛинии");
		
		Если ИнтеграцияИСКлиентСервер.ЭтоПродукцияМОТП(ВидПродукции) Тогда
			
			ОбязательныеРеквизиты.Добавить("ИдентификаторПроизводственнойЛинии");
			
			Если ВидПродукции = Перечисления.ВидыПродукцииИС.Табак
				И (Операция = Перечисления.ВидыОперацийИСМП.Агрегация
					Или ИнтеграцияИСМПКлиентСервер.ОперацииНанесенияКодовМаркировки().Найти(Операция) <> Неопределено) Тогда
				
				НепроверяемыеРеквизиты.Добавить("Товары.Номенклатура");
				НепроверяемыеРеквизиты.Добавить("Товары.Характеристика");
				
				НачалоGTINМаркировкиОстатков = ИнтеграцияИСМПСлужебныйКлиентСервер.НачалоGTINМаркировкиОстатков();
				
				Для Каждого СтрокаТовары Из Товары Цикл
					Если Не ЗначениеЗаполнено(СтрокаТовары.Номенклатура)
						И Не СтрНачинаетсяС(СтрокаТовары.GTIN, НачалоGTINМаркировкиОстатков)Тогда
						ТекстСообщения = СтрШаблон(
							НСтр(
								"ru = 'В строке %1 табличной части Товары не заполнено поле Номенклатура'"),
								СтрокаТовары.НомерСтроки);
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
							ЭтотОбъект,
							ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
								"Товары", СтрокаТовары.НомерСтроки, "Номенклатура"),,
							Отказ);
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
		ИначеЕсли ИнтеграцияИСПовтИсп.ЭтоПродукцияИСМП(ВидПродукции) Тогда
			НепроверяемыеРеквизиты.Добавить("ИдентификаторПроизводственнойЛинии");
			Если Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоВнеЕАЭС Тогда
				ОбязательныеРеквизиты.Добавить("ПринятоеРешение");
				ОбязательныеРеквизиты.Добавить("КодТаможенногоОргана");
				ОбязательныеРеквизиты.Добавить("ДатаДекларации");
				ОбязательныеРеквизиты.Добавить("РегистрационныйНомерДекларации");
			ИначеЕсли Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоРФПоДоговору
				Или Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоРФПоДоговоруНаСторонеЗаказчика Тогда
				ОбязательныеРеквизиты.Добавить("Контрагент");
				ОбязательныеРеквизиты.Добавить("ДатаПроизводства");
			ИначеЕсли Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоРФ Тогда
				ОбязательныеРеквизиты.Добавить("ДатаПроизводства");
			ИначеЕсли Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотТрансграничнаяТорговля Тогда
				ОбязательныеРеквизиты.Добавить("СтранаПроисхождения");
				ОбязательныеРеквизиты.Добавить("ДатаИмпорта");
				ОбязательныеРеквизиты.Добавить("ДатаПервичногоДокумента");
				ОбязательныеРеквизиты.Добавить("НомерПервичногоДокумента");
				ОбязательныеРеквизиты.Добавить("Контрагент");
			ИначеЕсли Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков Тогда
				
				НепроверяемыеРеквизиты.Добавить("Товары.Номенклатура");
				НепроверяемыеРеквизиты.Добавить("Товары.Характеристика");
				
				Для Каждого СтрокаТовары Из Товары Цикл
					Если Не ЗначениеЗаполнено(СтрокаТовары.GTIN)
						И Не ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда
						ТекстСообщения = СтрШаблон(
							НСтр(
								"ru = 'В строке %1 табличной части Товары не заполнено поле GTIN'"),
								СтрокаТовары.НомерСтроки);
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
							ЭтотОбъект,
							ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
								"Товары", СтрокаТовары.НомерСтроки, "GTIN"),,
							Отказ);
					КонецЕсли;
				КонецЦикла;
				
			ИначеЕсли Операция = Перечисления.ВидыОперацийИСМП.Агрегация Тогда
				
				НепроверяемыеРеквизиты.Добавить("Товары.Номенклатура");
				НепроверяемыеРеквизиты.Добавить("Товары.Характеристика");
				
				НачалоGTINМаркировкиОстатков = ИнтеграцияИСМПСлужебныйКлиентСервер.НачалоGTINМаркировкиОстатков();
				
				Для Каждого СтрокаТовары Из Товары Цикл
					Если Не ЗначениеЗаполнено(СтрокаТовары.Номенклатура)
						И Не СтрНачинаетсяС(СтрокаТовары.GTIN, НачалоGTINМаркировкиОстатков)Тогда
						ТекстСообщения = СтрШаблон(
							НСтр(
								"ru = 'В строке %1 табличной части Товары не заполнено поле Номенклатура'"),
								СтрокаТовары.НомерСтроки);
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
							ЭтотОбъект,
							ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
								"Товары", СтрокаТовары.НомерСтроки, "Номенклатура"),,
							Отказ);
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			Если ВидПродукции = Перечисления.ВидыПродукцииИС.МолочнаяПродукция
				И (ИнтеграцияИСМПКлиентСервер.ОперацииНанесенияКодовМаркировки().Найти(Операция)<>Неопределено
					Или (ЗначениеЗаполнено(ОперацияНанесения)
						И (Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоРФ
						Или Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоВнеЕАЭС
						Или Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотТрансграничнаяТорговля)))Тогда
				ОбязательныеРеквизиты.Добавить("Товары.ИдентификаторПроисхожденияВЕТИС");
				ОбязательныеРеквизиты.Добавить("Товары.СрокГодности");
			КонецЕсли;
		КонецЕсли;
		
		ИнтеграцияИСМППереопределяемый.ПриОпределенииОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
		
		Если Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков
			Или Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотПолучениеПродукцииОтФизическихЛиц
			Или Операция = Перечисления.ВидыОперацийИСМП.Агрегация
			Или ИнтеграцияИСКлиентСервер.ЭтоПродукцияМОТП(ВидПродукции) Тогда
			НепроверяемыеРеквизиты.Добавить("Товары.КодТНВЭД");
		КонецЕсли;
	
		Если Операция = Перечисления.ВидыОперацийИСМП.Агрегация Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка", ШтрихкодыУпаковок.ВыгрузитьКолонку("ШтрихкодУпаковки"));
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода
			|ИЗ
			|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
			|ГДЕ
			|	ШтрихкодыУпаковокТоваров.Ссылка В (&Ссылка)
			|	И ШтрихкодыУпаковокТоваров.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Количество() Тогда
				ТекстСообщения = НСтр("ru = 'Для операции Агрегация требуется указание упаковок.
				                            |Откройте форму проверки и подбора и агрегируйте все коды маркировки.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
					ЭтотОбъект,
					"Операция",,
					Отказ);
			КонецЕсли;
		КонецЕсли;
		
		ИнтеграцияИСМПСлужебный.ПроверитьЗаполнениеШтрихкодовУпаковок(ЭтотОбъект, Отказ);
		
	КонецЕсли;
	
	НепроверяемыеРеквизиты = ОбщегоНазначенияКлиентСервер.РазностьМассивов(НепроверяемыеРеквизиты, ОбязательныеРеквизиты);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если Не ЭтоНовый() Тогда
		ЭтоАгрегация = Операция = Перечисления.ВидыОперацийИСМП.Агрегация;
		ЭтоБылаАгрегация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Операция") = Перечисления.ВидыОперацийИСМП.Агрегация;
		Если ЭтоАгрегация<>ЭтоБылаАгрегация Тогда
			ДополнительныеСвойства.Вставить("ТребуетсяПерезаписьСтатусаПоУмолчанию");
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = Неопределено;
	ШтрихкодыУпаковок.Очистить();
	ИдентификаторПроизводственногоЗаказа = "";
	ИдентификаторПроизводственнойЛинии   = "";
	
	ДанныеОтчетаПроизводственнойЛинии.Очистить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияИСМП.ЗаписатьСтатусДокументаИСМППоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаЗаполнения

Процедура ЗаполнитьОбъектПоСтатистике()
	
	ДанныеСтатистики = ЗаполнениеОбъектовПоСтатистикеИСМП.ДанныеЗаполненияМаркировкиТоваровИСМП(Организация);
	
	Для Каждого КлючИЗначение Из ДанныеСтатистики Цикл
		ЗаполнениеОбъектовПоСтатистикеИСМП.ЗаполнитьПустойРеквизит(ЭтотОбъект, ДанныеСтатистики, КлючИЗначение.Ключ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьТоварыСрокомГодностиВЕТИС()
	
	Если ВидПродукции <> Перечисления.ВидыПродукцииИС.МолочнаяПродукция Тогда
		Возврат;
	КонецЕсли;
	
	Идентификаторы = Товары.Выгрузить(,"ИдентификаторПроисхожденияВЕТИС").ВыгрузитьКолонку("ИдентификаторПроисхожденияВЕТИС");
	ДанныеИдентификаторовПроисхождения = ИнтеграцияИСМПВЕТИС.ДанныеИдентификаторовПроисхождения(Идентификаторы);
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТовары.ИдентификаторПроисхожденияВЕТИС) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеПоИдентификатору = ДанныеИдентификаторовПроисхождения.Получить(СтрокаТовары.ИдентификаторПроисхожденияВЕТИС);
		Если ДанныеПоИдентификатору = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТовары.СрокГодности = ДанныеПоИдентификатору.СрокГодности;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
